

print("Hello World")

# hhhh

"""
1. Создать проект
2. Инициализировать гит
git init
3. Создать окружение
4. Добавить в гитигнор файлы окружения
5. Сделать файл lesson_10.py
5.1 Создать .gitignore
5.2 Добавить в него виртуальное окружение
- Pycharm создат автоматически
- VS Code
    1. python -m venv vevn
       venv/Scripts/activate
    2. Что более преподчитетльнее, потому что он запомнит окружение
    и будет включать его при октрытии проекта
    ctrl + shift + P
    Выбор интерпретатора
    Создание виртуальной среды
    Venv
    Выбрать интерпретатор из системных (у вас может быть несколько версий быть в системе)
   
6. Сделать первые коммиты
- git add <file_name>
- git commit -m "message"
7. Добавить файлы в гит
8. Закоммитить изменения
9. Запушить изменения в гитхаб
"""